// PrivacyPage.tsx
import { HeaderTwo } from '../cmps/headertwo';
import React from 'react';

export const PrivacyPage=():  JSX.Element => {
  return (
    <div className='privacy'>
        <HeaderTwo/>
      <h2>א. הקדמה</h2>
      <p>הפרטיות של המבקרים באתר שלנו חשובה לנו מאוד, ואנחנו מחויבים לשמירה עליה. המדיניות הזו מסבירה מה נעשה עם הפרטים האישיים שלכם.</p>
      <p>ההסכמה לשימוש שלנו בעוגיות בהתאם לתנאים של מדיניות זו בזמן הביקור הראשון באתר שלנו, מאפשרת לנו להשתמש בעוגיות בכל פעם שאתם מבקרים באתר.</p>
      <h2>ב. קרדיט</h2>
      <p>המסמך הזה נוצר בעזרת תבנית של SEQ Legal (seqlegal.com) ושונתה על ידי Website Planet (www.websiteplanet.com)</p>
      <h2>ג. איסוף פרטים אישיים</h2>
      <p>ייתכן שהסוגים הבאים של פרטים אישיים ייאספו, יאוחסנו, ויעשה בהם שימוש:</p>
      <p>
מידע שאתם מזינים בזמן יצירת פרופיל באתר שלנו: השם שלכם הגיל שלכם ומספר הטלפון שלכםו</p>
<h2>ד.שימוש בפרטים האישיים שלכם</h2>
<p>הבפרטים אישיים שנמסרו לנו דרך האתר שלנו ייעשה שימוש למטרות שצוינו במדיניות זו, או בעמודים הרלוונטיים שבאתר. ייתכן שנשתמש בפרטים האישיים שלכם למטרות הבאות:
ניהול האתר והעסק שלנו;
התאמה האישית של האתר עבורכם;
לאפשר לכם להשתמש בשירותים הזמינים באתר שלנו;
</p>
<h2>ה.חשיפת פרטים אישיים</h2>
<p>
אנחנו עשויים למסור את הפרטים האישיים שלכם:
לפי מה שנדרש מאתנו על פי חוק;</p>
בהקשר של כל הליך משפטי קיים או עתידי;
על מנת לבסס, להפעיל, או להגן על זכויותינו המשפטיות (כולל אספקה של מידע לאחרים למטרות מניעת הונאה והפחתה של סיכון אשראי);
לרוכש (או הרוכש הפוטנציאלי) של כל עסק או רכוש שאנחנו רוכשים (או שוקלים לרכוש);
ולכל אדם שאנחנו מאמינים במידה סבירה שעשוי לפנות לבית דין או לכל רשות מוסמכת לצורך מסירה של הפרטים האישיים בהם סביר לדעתנו שאותו בית דין או רשות יורה על מסירה של פרטים אישיים אלה.
למעט על פי הכתוב במדיניות זו, אנו לא נספק את הפרטים האישיים שלכם לצד ג’.<p/>
<h2>ו.אבטחת הפרטים האישיים שלכם</h2>
<p>אנחנו ננקוט משנה זהירות ארגוני וטכני סביר על מנת למנוע את האבדן, השימוש לרעה, או השינוי של הפרטים האישיים שלכם.
אנחנו נאחסן את כל הפרטים האישיים שאתם מספקים בשרתים מאובטחים (המוגנים בסיסמא ובחומת אש).
כל ההעברות הכספיות הממוחשבות שבוצעו דרך האתר שלנו יהיו מוגנות באמצעות טכנולוגיית הצפנה.
אתם מכירים בכך שהשידור של מידע על פני האינטרנט אינו מאובטח מעצם היותו, ואנחנו ללא יכולים להבטיח שנתונים שנשלחים דרך האינטרנט יהיו מאובטחים.
אתם אחראים על שמירת הסיסמא בה אתם משתמשים לקבלת גישה לאתר שלנו חסויה; אנחנו לא נבקש מכם את הסיסמא שלכם (למעט בזמן ההתחברות לאתר שלנו).
ט. תיקונים
אנחנו עשויים לעדכן מדיניות זו מעת לעת באמצעות פרסום של גרסה חדשה באתר שלנו. עליכם לבדוק את העמוד הזה מדי פעם על מנת לוודא שאתם מבינים כל שינוי שנעשה במדיניות זו. אנחנו עשויים להודיע לכם על שינויים במדיניות זו בהודעת דואר אלקטרוני או דרך מערכת ההודעות הפרטיות שבאתר שלנו.
י. הזכויות שלכם
אתם יכולים להורות לנו לספק לכם כל פרט מפרטיכם האישיים שאנו מחזיקים הנוגעים אליכם; אספקת פרטים אלה תהיה כפופה לתנאים הבאים:;
אספקה של ראיות הולמות עבור הזהות שלכם
אנחנו עשויים לסרב למסור פרטים אישיים שאתם מבקשים עד למידה המורשית על פי חוק.
אתם יכולים להורות לנו בכל עת לא לעבד את הפרטים האישיים שלכם לצורכי שיווק.
בפועל, בדרך כלל תבטאו הסכמה מראש לשימוש שלנו בפרטים האישיים שלכם למטרות שיווק, או שאנחנו נספק לכם אפשרות לבחור שלא יעשה בפרטים האישיים שלכם שימוש למטרות שיווקיות.
יא. אתרים צד ג’
האתר שלנו כולל קישורים חיצוניים, ופרטים על, אתרים צד ג’. אין לנו שליטה על, ואיננו אחראים על, מדיניות הפרטיות והנהלים של כל צד ג’.
יא. אתרים צד ג’
האתר שלנו כולל קישורים חיצוניים, ופרטים על, אתרים צד ג’. אין לנו שליטה על, ואיננו אחראים על, מדיניות הפרטיות והנהלים של כל צד ג’.
יב. עדכון מידע
אני הודיעו לנו אם יש צורך לתקן או לעדכן את הפרטים האישיים שאנו מחזיקים עליכם.
יג. עוגיות
האתר שלנו משתמש בעוגיות. עוגייה היא קובץ המכיל מזהה (מחרוזת של אותיות ומספרים) שנשלח על ידי שרת אינטרנט לדפדפן אינטרנט ומאוחסן בדפדפן. אז, המזהה נשלח בחזרה לשרת בכל פעם שהדפדפן מבקש מהשרת להציג דף אינטרנט. עוגיות יכולות להיות או עוגיות “עיקשות” או עוגיות “פעולה” (session): עוגייה עיקשת תאוחסן בדפדפן שלכם ותישאר בתוקף עד תאריך התפוגה שנקבע לה, אלא אם תימחק על ידי המשתמש לפני תאריך התפוגה; עוגיית פעולה, מאידך, תפוג בסוף זמן הגלישה הנוכחי שלכם, כשתסגרו את הדפדפן. בדרך כלל עוגיות לא כוללות מידע שמזהה משתמשים אישית, אבל פרטים אישיים שאנחנו מאחסנים הנוגעים עליכם יכולים להיות מקושרים למידע המאוחסן והמתקבל מתוך עוגיות. 
השמות של העוגיות בהן אנחנו משתמשים באתר שלנו, והמטרות לשמן הן בשימוש, מפורטות מטה:
אנחנו משתמשים בשירותי Google Analytics ו-Adwords באתר שלנו כדי לזהות מחשב כשמשתמש;
רוב האתרים מאפשרים לכם לסרב לשימוש בעוגיות—למשל:
באינטרנט אקספלורר (גרסה 10) אתם יכולים לחסום עוגיות בעזרת הגדרות עקיפת הטיפול בעוגיות הזמינות באמצעות לחיצה על “כלים,” “אפשרויות אינטרנט,” “פרטיות,” ואז “מתקדם”;
בפיירפוקס (גרסה 24) אתם יכולים לחסום את כל העוגיות באמצעות לחיצה על “כלים,” “אפשרויות,” “פרטיות,” ובחירה של “השתמש בהגדרות מותאמות אישית עבור היסטוריה” מתוך התפריט הנפתח, ואז ביטול הזימון של “קבל עוגיות מאתרים”;
ובכרום (גרסה 29), אתם יכולים לחסום את כל העוגיות באמצעות כניסה לתפריט “התאמה אישית ובקרה,” ואז ללחוץ על “הגדרות,” “הצג הגדרות מתקדמות,” ו-“הגדרות תוכן,” ואז לבחור באפשרות “חסום אתרים מהגדרה של נתונים” תחת הכותרת “עוגיות.”
לחסימה של כל העוגיות תהיה השפעה שלילית על נוחות השימוש של אתרים רבים. אם תחסמו עוגיות, לא תוכלו להשתמש בכל האפשרויות שבאתר שלנו.
אתם יכולים למחוק עוגיות שכבר מאוחסנות במחשב שלכם—למשל:
בדפדפן אינטרנט אקספלורר (גרסה 10), אתם צריכים למחוק קבצי עוגיות ידנית (תוכלו למצוא הוראות לכך בכתובת http://support.microsoft.com/kb/278835 );
בפיירפוקס (גרסה 24), אתם יכולים למחוק עוגיות באמצעות לחיצה על “כלים,” “אפשרויות,” ו-“פרטיות”, ואז לבחור “השתמש בהגדרות מותאמות אישית עבור היסטוריה”, וללחוץ על “הצג עוגיות,” ואז “הסר את כל העוגיות”;
ובכרום (גרסה 29), אתם יכולים למחוק את כל העוגיות באמצעות כניסה לתפריט “התאמה אישית ובקרה,” ואז ללחוץ על “הגדרות,” “הצג הגדרות מתקדמות,” ו-“נקה נתוני גלישה,” ואז לבחור באפשרות “מחק עוגיות ונתונים אחרים של אתרים ותוספים,” ולבסוף ללחוץ “נקה נתוני גלישה.”
למחיקה של עוגיות תהיה השפעה שלילית על נוחות השימוש של אתרים רבים.</p>
      {/* Add more translated text as needed for your privacy policy */}
    </div>
  );
};

