// PrivacyPage.tsx
import { HeaderTwo } from '../cmps/headertwo';
import React from 'react';

export const PrivacyPage = (): JSX.Element => {
  return (
    <div className='privacy'>
      <HeaderTwo />
      <h2>הקדמה</h2>
      <p>הפרטיות שלכם חשובה לנו מאוד. מדיניות זו מסבירה איך אנו מטפלים במידע האישי שלכם באתר שלנו.</p>
      <p>בשימוש באתר שלנו, אתם מסכימים לשימוש שלנו בעוגיות בהתאם לתנאים של מדיניות זו במהלך הביקור שלכם.</p>

      <h2>קרדיט</h2>
      <p>מסמך זה נוצר בעזרת תבנית מאת SEQ Legal (seqlegal.com) ושונה על ידי Website Planet (www.websiteplanet.com).</p>

      <h2>איסוף מידע</h2>
      <p>אין חובה להכניס פרטים אישיים, וניתן להשתמש בפרטים בדויים. המידע שנאסף לא ישמש לכל מטרה אחרת מלבד מה שצוין במסמך זה.</p>

      <h2>שימוש במידע האישי שלכם</h2>
      <p>המידע האישי שלכם יישמש רק כפי שמצוין במסמך זה.</p>

      <h2>חשיפת מידע אישי</h2>
      <p>אנו עשויים לחשוף את המידע שלכם כאשר זה נדרש על פי חוק; במסגרת הליכים משפטיים נוכחיים או עתידיים. מעבר למצוין במדיניות זו, אנו לא נחשוף את המידע שלכם לצד שלישי.</p>

      <h2>אבטחת המידע שלכם</h2>
      <p>אנו ננקוט בזהירות ארגונית וטכנית סבירה כדי למנוע אובדן, שימוש לרעה או שינוי של המידע שלכם. כל המידע שאתם מספקים יאוחסן בשרתים מאובטחים המוגנים בסיסמה וחומת אש.</p>
      <p>ידוע לכם כי העברת מידע באינטרנט אינה מאובטחת לחלוטין, ואיננו יכולים להבטיח את אבטחת המידע שנשלח ברשת. אחריותכם לשמור על סודיות הסיסמה שבה אתם משתמשים לגישה לאתר שלנו.</p>

      <h2>תיקונים</h2>
      <p>אנו עשויים לעדכן את מדיניות זו מעת לעת על ידי פרסום גרסה חדשה באתר שלנו. מומלץ לבדוק את העמוד הזה מדי פעם כדי לוודא שאתם מבינים כל שינוי שנעשה במדיניות זו. אנו עשויים להודיע לכם על שינויים במדיניות זו באמצעות דואר אלקטרוני או דרך מערכת ההודעות הפרטית באתר שלנו.</p>

      <h2>הזכויות שלכם</h2>
      <p>אתם יכולים לבקש מאיתנו לספק לכם כל מידע אישי שאנו מחזיקים אודותיכם; ספקת מידע זו תהיה כפופה להצגת ראיות מזההות עבור הזהות שלכם.</p>
      <p>אנו עשויים לסרב למסור מידע אישי בהתאם למורשת על פי חוק.</p>
    </div>
  );
};
