// PrivacyPage.tsx
import { HeaderTwo } from '../cmps/headertwo';
import React from 'react';

export const PrivacyPage = (): JSX.Element => {
  return (
    <div className='privacy'>
      <HeaderTwo />
      <h2>מדיניות פרטיות</h2>
      <p>מדיניות זו מתארת איך אנו מטפלים במידע אישי שאתם מספקים בעת שימוש באפליקציה שלנו. אנו מחויבים לשמירה על פרטיותכם ולהגנה על המידע האישי שאתם מוסרים לנו.</p>

      <h2>קישוריות למדיניות</h2>
      <p>מדיניות זו זמינה באופן ציבורי בכתובת URL פעילה ונגישה ומקושרת מדף החנות שלנו ב-Google Play ובתוך האפליקציה עצמה.</p>

      <h2>איסוף מידע</h2>
      <p>אנו אוספים שמות פרטיים, שמות משפחה ומספרי טלפון. אין חובה להכניס פרטים אמיתיים, וניתן להשתמש בפרטים בדויים. המידע נשמר באופן מאובטח.</p>

      <h2>שימוש במידע</h2>
      <p>המידע שנאסף משמש אותנו להתאמה ולשיפור חוויות השימוש באפליקציה. אנו לא משתפים את המידע עם צדדים שלישיים.</p>

      <h2>אבטחת מידע</h2>
      <p>אנו מיישמים צעדים טכניים וארגוניים כדי להבטיח את אבטחת המידע שלכם ולמנוע גישה לא מורשית, הפרעה, אובדן או השחתת מידע.</p>

      <h2>זכויות</h2>
      <p>בכל עת, תוכלו לפנות אלינו כדי לברר אילו מידע אישי אנו מחזיקים עליכם, לתקן או לעדכן את המידע, או לבקש למחוק את המידע ממאגרי מידע שלנו.</p>

      <h2>פניות</h2>
      <p>לכל שאלה או פנייה בנושא פרטיות, נא לפנות לנקודת הקשר שלנו באמצעות דוא"ל בכתובת: [כתובת הדוא"ל שלכם].</p>

      <h2>עדכונים למדיניות</h2>
      <p>אנו שומרים לעצמנו את הזכות לעדכן את מדיניות הפרטיות מעת לעת. כל שינויים יפורסמו באותה כתובת URL ויכנסו לתוקף מיד לאחר פרסומם.</p>
    </div>
  );
};
